[
  {
    "id": "6b3249d4-e407-4539-9859-6e81101a3b38",
    "title": "How to Access God’s Strength",
    "content": "We all face days when the weight of our circumstances feels like too much to carry. But here’s the good news: God’s strength is not just a vague hope or a distant possibility. It’s a promise—one that’s meant to be received, not just admired from afar. Throughout Scripture, God’s reputation is clear: He is the Lord who gives strength to His people. Psalm 29:11 says, “The LORD gives his people strength; the LORD blesses his people with peace.”\r\n\r\nYou might be wondering, “If God’s strength is promised, why don’t I always feel it?” Here’s the hard truth: God’s promises are available to us, but they aren’t automatic. Receiving His strength isn’t like a divine download that just happens while we’re on autopilot. There’s a part we play in accessing what God has already made available.",
    "autherEmail": "mahi@gmail.com",
    "tags": [
      "god",
      "strength"
    ],
    "image": "/uploads/1753185127005-god_strength.jpg",
    "date": "2025-07-22T11:52:07.007Z"
  },
  {
    "id": "b0db036c-50e2-4f18-a926-23fd201d9b83",
    "title": "Meditation is the Key to a Flourishing Life",
    "content": "Psalm 1:2 describes the “happy” person as one whose “delight is in the instruction of the Lord, and on his instruction he meditates day and night.” The Hebrew word for “meditate” here isn’t about emptying your mind, but about filling it—chewing on God’s words, letting them shape your thoughts, desires, and actions. It’s not a legalistic box to check, but a way of life that leads to true happiness and resilience. Our delight is what we meditate and feed on! If you are hearing this and that’s not you today—you don’t delight in God’s word. That’s okay! Where you are today does not have to be where you are tomorrow! That’s gospel! That’s good news! Treat this like an experiment.",
    "autherEmail": "mahi@gmail.com",
    "tags": [
      "meditation"
    ],
    "image": "/uploads/1753185885113-meditation.jpg",
    "date": "2025-07-22T12:04:45.114Z"
  },
  {
    "id": "3146f9ef-7182-4315-bc82-6988934b2577",
    "title": "When You’re Disconnecting from God",
    "content": "There have been seasons where as soon as I start my day, I begin thinking about what I emails I need to respond to, and the people I need to call back, and the projects I need to finish, and the friends I need to catch up with, and the spouse that I need to show some attention to, and the lunches that need to be packed, and the bills that need to be paid, and somewhere in there I need to take care of my own mental health, physical health, emotional health but I also need to make sure dinner is ready, and that my dog gets walked, is the laundry done, is project complete, did I send those final emails…and the cycle goes on and on.\r\n\r\nAnd now at this point I feel overwhelmed, burdened and begin questioning “God, where are you in all of this?!”\r\n\r\nI wonder if God looks at us and says, “No, where are YOU? I’ve been here this whole time, waiting for you.”\r\n\r\nBecause not ONCE did I even think about, let alone rely on God. I got so busy with life and doing things all on my own and I found myself disconnected from Jesus.\r\n\r\nJesus actually talks specifically to when we find ourselves DISCONNECTED from God. Not on purpose, but because life has found us in a season where we’ve drifted. When He gives His final “I AM” statement in John 15, it’s one that deals directly with our relationship with Him…and here’s what I learned in studying it.",
    "autherEmail": "mahi@gmail.com",
    "tags": [
      "god",
      "connection"
    ],
    "image": "/uploads/1753189782440-luke-besley-035WvAGTLYw-unsplash.jpg",
    "date": "2025-07-22T13:09:42.443Z"
  },
  {
    "id": "734ce0a8-5cd3-4795-b32f-0d9fb38cd17d",
    "title": "sdfsdwe",
    "content": "A blog is a type of website or online platform where individuals or groups regularly publish articles, posts, or other content, often in a conversational or informal style. Blogs are typically displayed in reverse chronological order, with the most recent posts appearing first",
    "autherEmail": "mahi@gmail.com",
    "tags": [
      "[]"
    ],
    "image": null,
    "date": "2025-07-29T09:05:03.793Z"
  }
]